app/controllers/bids_controller.rb

  def show
    @bid = Bid.find(params[:id])
---
SELECT * FROM "bids" WHERE ("bids"."id" = 1)

  def create
    @bid = Bid.new(params[:bid])

    respond_to do |format|
      if @bid.save
---
INSERT INTO "bids" ("price", "created_at", "comments", "updated_at", "pricing_method", "worker_id", "job_id") VALUES(3232.0, '2010-03-16 05:53:17', 'A ver que pasa...', '2010-03-16 05:53:17', 'contado', NULL, NULL)