app/controllers/employers_controller.rb

  def index
    @employers = Employer.all
---
SELECT * FROM "employers"

  def show
    @employer = Employer.find(params[:id])
---
SELECT * FROM "employers" WHERE ("employers"."id" = 1)

  def create
    @employer = Employer.new(params[:employer])

    respond_to do |format|
      if @employer.save
---
INSERT INTO "employers" ("address1", "city", "address2", "created_at", "company_name", "zip_code", "country", "updated_at", "pay_method", "user_id", "last_name", "phone", "first_name", "state") VALUES('Raffo 2976', 'Saenz Peña', '', '2010-03-16 00:02:54', 'ITParc', '1674', 'Argentina', '2010-03-16 00:02:54', '', 0, 'Parra', '828-2871281', 'Fernando', 'Buenos Aires')