app/controllers/jobs_controller.rb

SELECT * FROM "employers" WHERE ("employers"."id" = 1)
---
  def show
    @job = Job.find(params[:id], :include => [:employer, :category])