app/controllers/users_controller.rb

  def create
    @owner = Employer.new(params[:employer]) if params[:employer]
    @owner = Worker.new(params[:worker]) if params[:worker]
    @owner.save

    @user = User.new(params[:user])
    @user.owner = @owner

    if @user.save_without_session_maintenance
---
INSERT INTO "employers" ("address1", "city", "address2", "created_at", "company_name", "zip_code", "country", "updated_at", "pay_method", "user_id", "last_name", "phone", "first_name", "state") VALUES('Raffo 2976', '', '', '2010-03-17 22:34:44', 'ITParc', '', '', '2010-03-17 22:34:44', '', 1, 'Parra', '', 'Fernando', '')
INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('2010-03-17 01:15:44', '2010-03-17 01:15:44', '3c887ae7cde13763fd22778d704270b008608285e50fb62c28ec74245915cb941fe6095e96f523c8999c07558170c8751bd6820227fcf5bf152265884e4e856a', '2010-03-17 01:15:44', '127.0.0.1', 'Rw-D6rtXNNgZjT5u9POG', '2010-03-17 01:15:44', 'aecbd055297e9d76995c7409c2ba341aabf1ea232f141fffb878384ffbc2d0e53740a701a30add0f3e618a9c2d85cd318065c1c3f94e2158554fbfa92b991640', 1, NULL, NULL, 'ferparra83@gmail.com')