app/controllers/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT * FROM "workers"

  def show
    @worker = Worker.find(params[:id])
---
SELECT * FROM "workers" WHERE ("workers"."id" = 1)

  def create
    @worker = Worker.new(params[:worker])

    respond_to do |format|
      if @worker.save
---
INSERT INTO "workers" ("address1", "city", "business_name", "address2", "year_comp_founded", "created_at", "country", "zip_code", "company_phone", "stock_parts", "company_background", "updated_at", "website_url", "company_logo", "last_name", "phone", "number_employees", "first_name", "state", "detailed_service_desc") VALUES('', '', '', '', NULL, '2010-03-16 03:13:26', '', '', '', '', '', '2010-03-16 03:13:26', '', '', 'Perez', '', '', 'Roberto', '', '')